# Web development
brew "git"
brew "gh"
brew "ripgrep"
brew "fd"
brew "fzf"
brew "jq"
brew "bat"
brew "eza"
brew "shellcheck"
brew "shfmt"
brew "tmux"
brew "node"
brew "python"
brew "go"
brew "rust"

cask "visual-studio-code"
cask "iterm2"
cask "docker"
cask "postman"
cask "google-chrome"
cask "rectangle"
