# Minimal core (light + useful CLI)
brew "git"
brew "gh"
brew "ripgrep"
brew "fd"
brew "fzf"
brew "jq"
brew "bat"
brew "eza"
brew "shellcheck"
brew "shfmt"
brew "tmux"
brew "starship"
brew "zoxide"
brew "tldr"
brew "delta"
brew "hyperfine"
brew "httpie"
brew "dust"
brew "procs"
brew "sd"
brew "grex"
brew "tree"
brew "watch"
brew "gnu-sed"

cask "visual-studio-code"
cask "iterm2"
cask "rectangle"
